In [1]:
## Pandas

## A very important lib. has a lot of data manipulation capabilities
## widely used for data analysis and cleaning.
## provides 2 primary data structures -  Series and Data frames
## series is 1d array object, data frame is 2d array

In [108]:
import pandas as pd

In [109]:
# Series

data = [1,2,3,4,5]
series = pd.Series(data) ## Here, Series is a inbuilt funciton
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [110]:
##Create a series form dictionary elements
data = {'a':1, 'b':2, 'c':3}
series_dict = pd.Series(data)
print(series_dict) ### here key values become the indexes, and values becomes values of the series

a    1
b    2
c    3
dtype: int64

In [135]:
## we can give different index based on the requirement
data = [10,20,30]
index = ['a','b','c']
## to use this index over here
pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [136]:
##Dataframe

## it is mutable , structured wuth rows and columns
## lets see how to create a dataframe from basic

##Creating a datafrome form a dictionary of list
data = {'Name' : ['Krish', 'John', 'Rohan'], 'Age' : [25,25,23], 'City' : ['NYC', 'LA', 'Florida']}
data_frame = pd.DataFrame(data)
print(data_frame)
print(type(data_frame))

    Name  Age     City
0  Krish   25      NYC
1   John   25       LA
2  Rohan   23  Florida
<class 'pandas.core.frame.DataFrame'>

In [137]:
## Create a dataframe from a list of dictionaries
data = [{'Name': 'Krish', 'Age' : 25, 'City' : 'NYC'} ,{'Name': 'John', 'Age' : 25, 'City' : 'LA'},{'Name': 'Rohan', 'Age' : 23, 'City' : 'Florida'}]
data_fr = pd.DataFrame(data)
print(data_fr)

    Name  Age     City
0  Krish   25      NYC
1   John   25       LA
2  Rohan   23  Florida

In [138]:
df = pd.read_csv('sales_data.csv')
df.head()
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [139]:
##Accesing data from dataframe
data_fr

    Name  Age     City
0  Krish   25      NYC
1   John   25       LA
2  Rohan   23  Florida

In [140]:
type(data_fr['Name'])

pandas.core.series.Series

In [141]:
data_fr.loc[0][1] ## Loc operation basically means row index

C:\Users\sonof\AppData\Local\Temp\ipykernel_13696\3134064412.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  data_fr.loc[0][1] ## Loc operation basically means row index

25

In [142]:
data_fr.iloc[:,:-1]

    Name  Age
0  Krish   25
1   John   25
2  Rohan   23

In [143]:
data_fr.iloc[0][0]

C:\Users\sonof\AppData\Local\Temp\ipykernel_13696\1853336911.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  data_fr.iloc[0][0]

'Krish'

In [144]:
data_fr.loc[1]

Name    John
Age       25
City      LA
Name: 1, dtype: object

In [145]:
## Accessing a specified  usind at

data_fr.at[2,'Name']

'Rohan'

In [146]:
data_fr

    Name  Age     City
0  Krish   25      NYC
1   John   25       LA
2  Rohan   23  Florida

In [147]:
##Accessing a specified element using iat

data_fr.iat[2,2] ## Here we give both rpw index and column index

'Florida'

In [148]:
## Data Manipulation with Dataframe
data_fr

    Name  Age     City
0  Krish   25      NYC
1   John   25       LA
2  Rohan   23  Florida

In [149]:
##Adding a column

data_fr['Salary'] = [500000, 600000, 700000]

In [150]:
data_fr

    Name  Age     City  Salary
0  Krish   25      NYC  500000
1   John   25       LA  600000
2  Rohan   23  Florida  700000

In [151]:
## Dropping a new column

data_fr.drop('Salary', axis=1) ## we give axis value as 1 because we want to cheack all the elements in table

    Name  Age     City
0  Krish   25      NYC
1   John   25       LA
2  Rohan   23  Florida

In [152]:
data_fr

    Name  Age     City  Salary
0  Krish   25      NYC  500000
1   John   25       LA  600000
2  Rohan   23  Florida  700000

In [153]:
## Even after dropping the salary column we still have it here because it is not a permananet operation.
## to make it a permanent operations, we have to give inplace  = True

data_fr.drop('Salary', axis=1, inplace=True)

## This inplace makes whatever drop operationn we do a permanent operartion

In [154]:
data_fr ## Now it is removed

    Name  Age     City
0  Krish   25      NYC
1   John   25       LA
2  Rohan   23  Florida

In [155]:
## Add Age to column

data_fr['Age'] = data_fr['Age']+1  ## Ages got incremented by 1

In [156]:
data_fr

    Name  Age     City
0  Krish   26      NYC
1   John   26       LA
2  Rohan   24  Florida

In [157]:
data_fr['Name'] = data_fr['Name'] + 'e'

In [158]:
data_fr

     Name  Age     City
0  Krishe   26      NYC
1   Johne   26       LA
2  Rohane   24  Florida

In [159]:
## if I want to drop based on row
data_fr.drop(0)

     Name  Age     City
1   Johne   26       LA
2  Rohane   24  Florida

In [160]:
## 0th row is gone but it is not permanent
## As you can see

data_fr

     Name  Age     City
0  Krishe   26      NYC
1   Johne   26       LA
2  Rohane   24  Florida

In [161]:
## For permanent

data_fr.drop(0, inplace=True)

In [164]:
data_fr  ## It's permanent now

     Name  Age     City
1   Johne   26       LA
2  Rohane   24  Florida